# Neo4j 创建节点

> 原文:[https://www.javatpoint.com/neo4j-create-nodes](https://www.javatpoint.com/neo4j-create-nodes)

节点是图形数据库中的数据或记录。在 Neo4j 中，CREATE 语句用于创建节点。您可以使用 create 语句创建以下内容:

*   创建单个节点
*   创建多个节点
*   创建带有标签的节点
*   创建具有多个标签的节点
*   创建具有属性的节点
*   返回创建的节点

* * *

## 创建单个节点

要在 Neo4j 中创建单个节点，请使用 create 语句指定节点的名称。

**语法:**

```

CREATE (node_name); 

```

#### 注意:可以添加或忽略分号(；).它是可选的。

**示例 1:**

在浏览器上打开 localhost:**http://localhost:7474/browser/**并使用以下代码:

```

CREATE (single); 

```

![Neo4j Create nodes 1](../Images/87d21d55484f0c58f44fc0373438fcfd.png)

输出:

![Neo4j Create nodes 2](../Images/4305d0149448fe0ffad46177d9a0db0e.png)

您可以看到创建了一个节点。

## 确认

执行以下代码来验证节点类型的创建:

```

MATCH (n) RETURN n 

```

输出:

![Neo4j Create nodes 3](../Images/a8c202047d51ebe62c99707ec272173a.png)

* * *

## 创建多个节点

要在 Neo4j 中创建多个节点，请使用用逗号分隔的节点名称的 create 语句。

**语法:**

```

CREATE (node1),(node2), (node1),???..    

```

**示例 2:**

让我们创建两个节点:主节点和次节点。

```

CREATE (primary_node), ( secondary_node); 

```

![Neo4j Create nodes 4](../Images/0c1d0a42bbdbe196f9199a70c4702c76.png)

## 确认

```

MATCH (n) RETURN n 

```

输出:

![Neo4j Create nodes 5](../Images/cadd7b2e670d54b534c32f9ab52ba709.png)

#### 注意:它显示 3 个节点，因为我们已经在示例 1 中创建了一个节点。

* * *

## 创建带有标签的节点

在 Neo4j 中，标签用于使用标签对节点进行分类。CREATE 语句用于为 Neo4j 中的节点创建标签。

**语法:**

```

CREATE (node:label) 

```

**示例 3:**

让我们创建一个标签为“科学家”的节点“Kalam”。

```

CREATE (Kalam:scientist) 

```

输出:

![Neo4j Create nodes 6](../Images/d27a9d9f3907503e803f3f6d4ded3ef2.png)

## 确认

```

MATCH (n) RETURN n 

```

输出:

![Neo4j Create nodes 7](../Images/b332c10b6b518ebdb09255362997cd86.png)

* * *

## 创建具有多个标签的节点

要用单个节点创建多个标签，必须用冒号“:”分隔节点的标签。

**语法:**

```

CREATE (node:label1:label2:. . . . labeln) 

```

**示例:**

创建一个带有标签“人”、“总统”和“科学家”的节点“Kalam”。

```

CREATE (Kalam:person:president:scientist) 

```

输出:

![Neo4j Create nodes 8](../Images/fce8d3cb10dfef88982fecc93b1d0266.png)

## 确认

![Neo4j Create nodes 9](../Images/6e067c83b86c3f609c806662d0371ad3.png)

* * *

## 使用属性创建节点

在 Neo4j 中，属性是节点用来存储数据的键值对。CREATE 语句用于创建带有属性的节点，您只需在大括号“{ }”内用逗号分隔这些属性即可。

**语法:**

```

CREATE (node:label { key1: value, key2: value, . . . . . . . . .  }) 

```

**示例:**

让我们创建一个节点“Ajeet”，具有以下属性:

```

CREATE (Ajeet:Developer{name: "Ajeet Kumar", YOB: 1989, POB: "Mau"}) 

```

输出:

![Neo4j Create nodes 10](../Images/598464eb4eca1db4e60c7fddf81a44d5.png)

## 确认

```

MATCH (n) RETURN n 

```

![Neo4j Create nodes 11](../Images/5d074bba6d7068b83566cb203f8d38e6.png)

* * *

## 返回创建的节点

MATCH (n) RETURN n 命令用于查看创建的节点。该查询返回数据库中所有现有的节点。

但是如果您想要返回新创建的节点，请使用 return 命令和 CREATE 命令:

**语法:**

```

CREATE (Node:Label{properties. . . . }) RETURN Node 

```

**示例:**

使用以下属性创建一个节点“Sonoo”，并返回该节点。

```

CREATE (Sonoo:trainer{name: "Sonoo Jaiswal", YOB: 1987, POB: "Faizabad"}) RETURN Sonoo 

```

输出:

![Neo4j Create nodes 12](../Images/479fd3eb8e9ffaf5bdce391cde952995.png)