# 选择匹配数据

> 原文:[https://www.javatpoint.com/neo4j-select-data-with-match](https://www.javatpoint.com/neo4j-select-data-with-match)

MATCH 语句用于获取符合给定标准的数据。MATCH 语句也用于执行一些操作并返回所有节点。

## 获取单个节点

**创建节点:**

```

CREATE (a:Actors { Name : "Sonu Nigam" }) 

```

**取单记录:**

```

MATCH (a:Actors)
WHERE a.Name = "Sonu Nigam"
RETURN a 

```

输出:

![Neo4j Data with match 1](../Images/c6280bee1ef6205b66cdad69f0e29545.png)

* * *

## 获取所有节点

如果您想从数据库中检索所有节点，只需避开过滤器。

使用以下代码从数据库中检索所有节点:

```

MATCH (n) RETURN n 

```

输出:

![Neo4j Data with match 2](../Images/ad4e09fa42d542218feddb2638fa4e5c.png)

**也可以用表格形式看到:**

**表格形式:**

![Neo4j Data with match 3](../Images/6ba8501e4a7ae847db289c12e9e34f09.png)