# 从 CSV 导入数据

> 原文:[https://www.javatpoint.com/neo4j-import-data-from-csv](https://www.javatpoint.com/neo4j-import-data-from-csv)

CSV 代表**逗号分隔值。**

LOAD CSV 语句用于将 CSV 文件中的数据导入 Neo4j 数据库。它便于您将 CSV 文件从其他数据库(即关系数据库)加载到 Neo4j 中。

您可以从本地或远程网址加载 CSV 文件。使用文件:/// URL 来访问本地存储的文件(在数据库服务器上)，否则，您可以使用任何 HTTPS、HTTP 和 FTP 协议导入远程文件。

* * *

## 加载一个 CSV 文件

让我们使用 HTTP 协议加载一个名为“names.csv”的 CSV 文件。它包含 10 个名称的列表，因此它将创建 10 个节点。

**例**

从本地存储导入 CSV 文件:

```

LOAD CSV FROM 'https://www.javatpoint.com/names.csv' AS line
CREATE (:Name { NameId: line[0], Name: line[1]})

```

输出:

![Neo4j Import data from csv 1](../Images/3665cfbda917c841c98c1c3107054360.png)

您可以使用以下查询来查看新创建的节点:

```

MATCH (n:Name) RETURN n 

```

输出:

![Neo4j Import data from csv 2](../Images/b28e642edafafc7d10ae71dea4d208be.png)