# Neo4j 跳过子句

> 原文:[https://www.javatpoint.com/neo4j-skip-clause](https://www.javatpoint.com/neo4j-skip-clause)

在 Neo4j 中，SKIP 子句用于定义如何跳过一行或从哪一行开始在输出中包含行。

**示例:**

让我们跳过前 3 个节点，从数据库中检索记录。

```
MATCH (n)  
RETURN n.name, n.Marks 
ORDER BY n.Marks DESC 
SKIP 3 

```

输出:

![Neo4j skips clause 1](../Images/bd18fbf07cac3b7dab38594fbb60f0c5.png)

* * *

## 使用表达式跳过

让我们举一个例子，在表达式中使用 SKIP 子句。

```
MATCH (n)  
RETURN n.name, n.Marks 
ORDER BY n.Marks DESC 
SKIP toInt (2*rand())+ 1

```

输出:

![Neo4j skips clause 2](../Images/98f061c0632b2d51bbf26709aecf2492.png)

本示例跳过数据库中的第一条记录，只显示剩余的记录。