# Neo4j 计数()函数

> 原文:[https://www.javatpoint.com/neo4j-count-function](https://www.javatpoint.com/neo4j-count-function)

在 Neo4j 数据库中，COUNT()函数用于统计行数。

**语法:**

```
MATCH (n { name: 'A' })-->(x) 
RETURN n, count(*) 

```

**示例:**

使用以下查询演示 COUNT()函数的用法。当印度获胜时，它会计算数字。

```
Match(n{name: "India", result: "Winners"})--(x)  
RETURN n, count(*) 

```

输出:

![Neo4j Count function 1](../Images/688c64be8dc4e86aaa2edeadfde8a00e.png)

* * *

## Group COUNT

您也可以使用 COUNT()函数来计算关系类型的组。

**示例:**

以下查询计算并返回参与每个关系的节点数。

```
Match(n{name: "India", result: "Winners"})-[r]-(x)  
RETURN type (r), count(*) 

```

![Neo4j Count function 2](../Images/ae54eb8150e5211862e51ee9de89cfd6.png)